## DataTypes

![DatTypes](SQL-Server-Data-Types.png)

#### Exact numeric data types:

Exact numeric data types store exact numbers such as integer, decimal, or monetary amount.

    The bit store one of three values 0, 1, and NULL
    The int, bigint, smallint, and tinyint data types store integer data.
    The decimal and numeric data types store numbers that have fixed precision and scale. Note that decimal and numeric are synonyms.
    The money and smallmoney data type store currency values.


|Data Type|	Lower limit|	Upper limit|	Memory|
|---------|------------|-----------|---------|
|bigint|	−2^63 (−9,223,372, 036,854,775,808)|	2^63−1 (−9,223,372, 036,854,775,807)|	8 bytes|
|int	|−2^31 (−2,147, 483,648)	|2^31−1 (−2,147, 483,647)	|4 bytes|
|smallint|	−2^15 (−32,767)	|2^15 (−32,768)|	2 bytes|
|tinyint|	0|	255	|1 byte|
|bit	|0	|1	|1 byte/8bit column|
|decimal	|−10^38+1|	10^381−1	|5 to 17 bytes|
|numeric	|−10^38+1|	10^381−1|	5 to 17 bytes|
|money|	−922,337, 203, 685,477.5808|	+922,337, 203, 685,477.5807	|8 bytes|
|smallmoney|	−214,478.3648|	+214,478.3647	|4 bytes|

#### Approximate numeric data types

The approximate numeric data type stores floating point numeric data. They are often used in scientific calculations.


|Data Type|	Lower limit|	Upper limit|	Memory|Precision|
|---------|------------|-----------|---------|------------|
|float(n)|	−1.79E+308	|1.79E+308|	Depends on the value of n|	7 Digit|
|real	|−3.40E+38|	3.40E+38	|4 bytes|	15 Digit|

#### Date & Time data types

|Data Type|	Storage size|	Accuracy|	Lower Range|	Upper Range|
|---------|------------|-----------|---------|--------|
|datetime	|8 bytes|	Rounded to increments of .000, .003, .007	|1753-01-01|	9999-12-31|
|smalldatetime|	4 bytes, fixed	1 minute	|1900-01-01|	2079-06-06|
|date|	3 bytes,| fixed	1 day	|0001-01-01	|9999-12-31|
|time|	5 bytes|	100 nanoseconds|	00:00:00.0000000	|23:59:59.9999999|
|datetimeoffset|	10 bytes	|100 nanoseconds	|0001-01-01	9999-12-31|
|datetime2|	6 bytes	|100 nanoseconds	|0001-01-01|	9999-12-31|

### Character strings data types

Character strings data types allow you to store either fixed-length (char) or variable-length data (varchar). The text data type can store non-Unicode data in the code page of the server.

|Data Type|	Lower limit|	Upper limit|	Memory|
|---------|------------|-----------|---------|
|char|	0 chars|	8000 chars|	n bytes|
|varchar|	0 chars|	8000 chars	|n bytes + 2 bytes|
|varchar (max)|	0 chars|	2^31 chars|	n bytes + 2 bytes|
|text|	0 chars|	2,147,483,647 chars|	n bytes + 4 bytes|

#### Unicode character string data types

Unicode character string data types store either fixed-length (nchar) or variable-length (nvarchar) Unicode character data.

|Data Type|	Lower limit|	Upper limit|	Memory|
|---------|------------|-----------|---------|
|nchar	|0 chars|	4000 chars	|2 times n bytes|
|nvarchar	|0 chars|	4000 chars	|2 times n bytes + 2 bytes|
|ntext	|0 chars|	1,073,741,823 char|	2 times the string length|

#### Binary string data types
The binary data types stores fixed and variable length binary data.

|Data Type|	Lower limit|	Upper limit|	Memory|
|---------|-----------|-------------|----------|
|binary|	0 bytes	|8000 bytes|	n bytes|
|varbinary	|0 bytes	|8000 bytes	|The actual length of data entered + 2 bytes|
|image|	0 bytes|	2,147,483,647 bytes	|

### Other data types

|Data Type	|Description|
|----------|-----------|
|cursor|	for variables or stored procedure OUTPUT parameter that contains a reference to a cursor|
|rowversion|	expose automatically generated, unique binary numbers within a database.|
|hierarchyid	|represent a tree position in a tree hierarchy|
|uniqueidentifier	|16-byte GUID|
|sql_variant	|store values of other data types|
|XML	|store XML data in a column, or a variable of XML type|
|Spatial Geometry type|	represent data in a flat coordinate system.|
|Spatial Geography type|	store ellipsoidal (round-earth) data, such as GPS latitude and longitude coordinates.|
|table	|store a result set temporarily for processing at a later time|

### BIT

In [1]:
import pyodbc
import os
import pandas as pd

#Check if drivers are installed
#[x for x in pyodbc.drivers() if x.startswith("Microsoft Access Driver")]

# Define the connection string
conn_str = (
    r'DRIVER={ODBC Driver 17 for SQL Server};'
    r'SERVER=localhost;'
    r'DATABASE=BikeStores;'
    r'Trusted_Connection=yes;'
)

# Establish the connection
conn = pyodbc.connect(conn_str)

# Create a cursor
cursor = conn.cursor()

In [2]:
cursor.execute('''
CREATE TABLE sql_server_bit (
bit_col BIT
);
''')

In [3]:
cursor.execute('''
INSERT INTO sql_server_bit (bit_col)
OUTPUT inserted.bit_col
VALUES(1);
''')

# Fetch all rows from the executed query
rows = cursor.fetchall()

# Get the column names
columns = [column[0] for column in cursor.description]

# Convert the rows into a list of dictionaries
data = [dict(zip(columns, row)) for row in rows]

# Create a DataFrame from the list of dictionaries
df = pd.DataFrame(data)
df.head(10)

   bit_col
0     True

In [4]:
cursor.execute('''
INSERT INTO sql_server_bit (bit_col)
OUTPUT inserted.bit_col
VALUES(0);
''')

# Fetch all rows from the executed query
rows = cursor.fetchall()

# Get the column names
columns = [column[0] for column in cursor.description]

# Convert the rows into a list of dictionaries
data = [dict(zip(columns, row)) for row in rows]

# Create a DataFrame from the list of dictionaries
df = pd.DataFrame(data)
df.head(10)

   bit_col
0    False

In [5]:
cursor.execute('''
INSERT INTO sql_server_bit (bit_col)
OUTPUT inserted.bit_col
VALUES
    ('True');
''')

# Fetch all rows from the executed query
rows = cursor.fetchall()

# Get the column names
columns = [column[0] for column in cursor.description]

# Convert the rows into a list of dictionaries
data = [dict(zip(columns, row)) for row in rows]

# Create a DataFrame from the list of dictionaries
df = pd.DataFrame(data)
df.head(10)

   bit_col
0     True

In [6]:
cursor.execute('''
INSERT INTO sql_server_bit (bit_col)
OUTPUT inserted.bit_col
VALUES
    ('False');
''')

# Fetch all rows from the executed query
rows = cursor.fetchall()

# Get the column names
columns = [column[0] for column in cursor.description]

# Convert the rows into a list of dictionaries
data = [dict(zip(columns, row)) for row in rows]

# Create a DataFrame from the list of dictionaries
df = pd.DataFrame(data)
df.head(10)

   bit_col
0    False

In [7]:
cursor.execute('''
INSERT INTO sql_server_bit (bit_col)
OUTPUT inserted.bit_col
VALUES
    (0.5);
''')

# Fetch all rows from the executed query
rows = cursor.fetchall()

# Get the column names
columns = [column[0] for column in cursor.description]

# Convert the rows into a list of dictionaries
data = [dict(zip(columns, row)) for row in rows]

# Create a DataFrame from the list of dictionaries
df = pd.DataFrame(data)
df.head(10)

   bit_col
0     True

In [8]:
cursor.execute('''
INSERT INTO sql_server_bit (bit_col)
OUTPUT inserted.bit_col
VALUES
    ('');
''')

# Fetch all rows from the executed query
rows = cursor.fetchall()

# Get the column names
columns = [column[0] for column in cursor.description]

# Convert the rows into a list of dictionaries
data = [dict(zip(columns, row)) for row in rows]

# Create a DataFrame from the list of dictionaries
df = pd.DataFrame(data)
df.head(10)

   bit_col
0    False

In [9]:
cursor.execute('''
INSERT INTO sql_server_bit (bit_col)
OUTPUT inserted.bit_col
VALUES
    (-5);
''')

# Fetch all rows from the executed query
rows = cursor.fetchall()

# Get the column names
columns = [column[0] for column in cursor.description]

# Convert the rows into a list of dictionaries
data = [dict(zip(columns, row)) for row in rows]

# Create a DataFrame from the list of dictionaries
df = pd.DataFrame(data)
df.head(10)

   bit_col
0     True

Basically, In SQL, 

All values other than empty strings and zero are True values

### INT

In [10]:
cursor.execute('''
CREATE TABLE sales.sql_server_integers (
	bigint_col bigint,
	int_col INT,
	smallint_col SMALLINT,
	tinyint_col tinyint
);
''')

In [11]:
cursor.execute('''
INSERT INTO sales.sql_server_integers (
	bigint_col,
	int_col,
	smallint_col,
	tinyint_col
)
VALUES
	(
		9223372036854775807,
		2147483647,
		32767,
		255
	);
''')

In [12]:
cursor.execute('''
SELECT
	bigint_col,
	int_col,
	smallint_col,
	tinyint_col
FROM
	sales.sql_server_integers;
''')


# Fetch all rows from the executed query
rows = cursor.fetchall()

# Get the column names
columns = [column[0] for column in cursor.description]

# Convert the rows into a list of dictionaries
data = [dict(zip(columns, row)) for row in rows]

# Create a DataFrame from the list of dictionaries
df = pd.DataFrame(data)
df.head(10)

            bigint_col     int_col  smallint_col  tinyint_col
0  9223372036854775807  2147483647         32767          255

In [13]:
cursor.execute('''
INSERT INTO sales.sql_server_integers (
	bigint_col,
	int_col,
	smallint_col,
	tinyint_col
)
VALUES
	(
		9223372036854775807,
		2147483647,
		32767,
		298
	);
''')

DataError: ('22003', '[22003] [Microsoft][ODBC Driver 17 for SQL Server][SQL Server]Arithmetic overflow error for data type tinyint, value = 298. (220) (SQLExecDirectW); [22003] [Microsoft][ODBC Driver 17 for SQL Server][SQL Server]The statement has been terminated. (3621)')

### DECIMAL

To store numbers that have fixed precision and scale, you use the DECIMAL data type.

The following shows the syntax of the DECIMAL data type:

DECIMAL(p,s)

In this syntax:

p is the precision which is the maximum total number of decimal digits that will be stored, both to the left and to the right of the decimal point. 
The precision has a range from 1 to 38. The default precision is 38.

s is the scale which is the number of decimal digits that will be stored to the right of the decimal point. The scale has a range from 0 to p (precision). The scale can be specified only if the precision is specified. By default, the scale is zero.

|Precision|	Storage bytes|
|----------|------------|
|1 – 9	|5 |
|10-19	|9 |
|20-28	|13 |
|29-38	|17 |

The NUMERIC and DECIMAL are synonyms, therefore, you can use them interchangeably.

The following declarations are equivalent:

DECIMAL(10,2)

NUMERIC(10,2)

Because the ISO synonyms for DECIMAL are DEC and DEC(p,s), you can use either DECIMAL or DEC:

DECIMAL(10,2)

DEC(10,2)

In [15]:
cursor.execute('''
CREATE TABLE sales.sql_server_decimal (
    dec_col DECIMAL (4, 2),
    num_col NUMERIC (4, 2)
);
''')

cursor.execute(''' 
INSERT INTO sales.sql_server_decimal (dec_col, num_col)
VALUES
    (10.05, 20.05);
''')

cursor.execute('''SELECT dec_col, num_col FROM sales.sql_server_decimal ''')


# Fetch all rows from the executed query
rows = cursor.fetchall()

# Get the column names
columns = [column[0] for column in cursor.description]

# Convert the rows into a list of dictionaries
data = [dict(zip(columns, row)) for row in rows]

# Create a DataFrame from the list of dictionaries
df = pd.DataFrame(data)
df.head(10)

  dec_col num_col
0   10.05   20.05

the following example attempts to insert a new row into the table with values that exceed the precision and scale specified in the column definition, we get the following error: 

    Arithmetic overflow error converting numeric to data type numeric.
    The statement has been terminated

In [16]:

cursor.execute('''INSERT INTO  sql_server_decimal (dec_col, num_col)
VALUES (999.99, 200.50) ''')


# Fetch all rows from the executed query
rows = cursor.fetchall()

# Get the column names
columns = [column[0] for column in cursor.description]

# Convert the rows into a list of dictionaries
data = [dict(zip(columns, row)) for row in rows]

# Create a DataFrame from the list of dictionaries
df = pd.DataFrame(data)
df.head(10)

DataError: ('22003', '[22003] [Microsoft][ODBC Driver 17 for SQL Server][SQL Server]Arithmetic overflow error converting numeric to data type numeric. (8115) (SQLExecDirectW); [22003] [Microsoft][ODBC Driver 17 for SQL Server][SQL Server]The statement has been terminated. (3621)')

### CHAR, NCHAR, VARCHAR, NVARCHAR

CHAR -> To store fixed-length, non-Unicode character string data in the database

NCHAR -> To store fixed-length, Unicode character string data in the database

|CHAR |NCHAR|
|:--------|:---------|
|Store only non-Unicode characters.	|Store Unicode characters in the form of UNICODE UCS-2 characters.|
|Need 1 byte to store a character	|Need 2 bytes to store a character.|
|The storage size equals the size specified in the column definition or variable declaration.	|The storage size equals double the size specified in the column definition or variable declaration.|
|Store up to 8000 characters.	|Store up to 4000 characters.|

In [20]:
cursor.execute('''
CREATE TABLE sales.sql_server_nchar(
nval NCHAR(1) NOT NULL, 
val CHAR(1) NOT NULL 
)
''')

In [21]:
cursor.execute('''
INSERT INTO  sql_server_nchar (nval, val)
VALUES (N'あ', 'あ')
''')

In [28]:
cursor.execute('''
INSERT INTO sql_server_nchar (nval, val)
VALUES
    (N'いえ', N'baraha'); 
''')

ProgrammingError: ('42000', "[42000] [Microsoft][ODBC Driver 17 for SQL Server][SQL Server]String or binary data would be truncated in table 'BikeStores.dbo.sql_server_nchar', column 'nval'. Truncated value: 'い'. (2628) (SQLExecDirectW); [42000] [Microsoft][ODBC Driver 17 for SQL Server][SQL Server]The statement has been terminated. (3621)")

SQL Server issued the following error message:

    String or binary data would be truncated.

    The statement has been terminated. 

    Code language: SQL (Structured Query Language) (sql)

To find the number of characters and the number of bytes of the values the val column, you use the LEN and DATALENGTH functions as follows:

In [31]:
cursor.execute(''' 
SELECT
    val,
    len(val) length,
    DATALENGTH(val) data_length
FROM
    sql_server_nchar;
''')


# Fetch all rows from the executed query
rows = cursor.fetchall()

# Get the column names
columns = [column[0] for column in cursor.description]

# Convert the rows into a list of dictionaries
data = [dict(zip(columns, row)) for row in rows]

# Create a DataFrame from the list of dictionaries
df = pd.DataFrame(data)
df.head(10)

  val  length  data_length
0   !       1            1
1   ¤       1            1
2   ¤       1            1
3   ?       1            1
4   ?       1            1
5   ?       1            1

In [29]:
cursor.execute(''' 
SELECT
    val,
    len(val) length,
    DATALENGTH(val) data_length
FROM
    test.sql_server_nchar;
''')

cursor.execute('''/
SELECT * FROM sql_server_nchar
''')

# Fetch all rows from the executed query
rows = cursor.fetchall()

# Get the column names
columns = [column[0] for column in cursor.description]

# Convert the rows into a list of dictionaries
data = [dict(zip(columns, row)) for row in rows]

# Create a DataFrame from the list of dictionaries
df = pd.DataFrame(data)
df.head(10)

  nval val
0    A   !
1    A   ¤
2    ?   ¤
3    ?   ?
4    ?   ?
5    あ   ?

VARCHAR -> VARCHAR data type is used to store variable-length, non-Unicode string data. 

NVARCHAR -> VARCHAR data type is used to store variable-length, Unicode string data.

||VARCHAR | NVARCHAR |
|----------|-----------|--------------|
|Character Data Type|	Variable-length, non-Unicode characters	Variable-length, both Unicode and non-Unicode characters such as Japanese, Korean, and Chinese.|Maximum Length	Up to 8,000 characters	Up to 4,000 characters|
|Character Size	|Takes up 1 byte per character	|Takes up 2 bytes per Unicode/Non-Unicode character|
|Storage Size	|Actual Length (in bytes)	|2 times Actual Length (in bytes)|
|Usage	|Used when data length is variable or variable length columns and if actual data is always way less than capacity	|Due to storage only, used only if you need Unicode support such as the Japanese Kanji or Korean Hangul characters.|

In [35]:
#Lets define varchar with fixed length

cursor.execute('''
CREATE TABLE sales.sql_server_varchar_withoutlength(
val VARCHAR NOT NULL
); 
''')

cursor.execute('''
INSERT INTO  sales.sql_server_varchar_withoutlength (val)
VALUES ('hello how are you!') 
''')

cursor.execute(''' SELECT * FROM sales.sql_server_varchar_withoutlength''')


# Fetch all rows from the executed query
rows = cursor.fetchall()

# Get the column names
columns = [column[0] for column in cursor.description]

# Convert the rows into a list of dictionaries
data = [dict(zip(columns, row)) for row in rows]

# Create a DataFrame from the list of dictionaries
df = pd.DataFrame(data)
df.head(10)

ProgrammingError: ('42000', "[42000] [Microsoft][ODBC Driver 17 for SQL Server][SQL Server]String or binary data would be truncated in table 'BikeStores.sales.sql_server_varchar_withoutlength', column 'val'. Truncated value: 'h'. (2628) (SQLExecDirectW); [42000] [Microsoft][ODBC Driver 17 for SQL Server][SQL Server]The statement has been terminated. (3621)")

Notice the error, the error is due to the fact that we have not provided size after datatype - VARCHAR(SIZE)

In [33]:
#Defining fixed size of 200 length 
cursor.execute('''
CREATE TABLE sales.sql_server_varchar_length(
val VARCHAR(200) NOT NULL
); 
''')

cursor.execute('''
INSERT INTO  sales.sql_server_varchar_length (val)
VALUES ('hello how are you!') 
''')

In [34]:
cursor.execute(''' SELECT * FROM sales.sql_server_varchar_length''')


# Fetch all rows from the executed query
rows = cursor.fetchall()

# Get the column names
columns = [column[0] for column in cursor.description]

# Convert the rows into a list of dictionaries
data = [dict(zip(columns, row)) for row in rows]

# Create a DataFrame from the list of dictionaries
df = pd.DataFrame(data)
df.head(10)

                  val
0  hello how are you!

In [36]:
cursor.execute('''
CREATE TABLE sales.sql_server_nvarchar_length(
val NVARCHAR(200) NOT NULL
); 
''')

cursor.execute('''
INSERT INTO  sales.sql_server_nvarchar_length (val)
VALUES (N' 你好 abcdefghijklmnopqrstuvwxyz1234567890abcdefghijklmnopqrstuvwxyz1234567890abcdefghijklmnopqrstuvwxyz1234567890abcdefghijklmnopqrstuvwxyz1234567890')
''')

In [38]:
cursor.execute(''' SELECT * FROM sales.sql_server_nvarchar_length''')


# Fetch all rows from the executed query
rows = cursor.fetchall()

# Get the column names
columns = [column[0] for column in cursor.description]

# Convert the rows into a list of dictionaries
data = [dict(zip(columns, row)) for row in rows]

# Create a DataFrame from the list of dictionaries
df = pd.DataFrame(data)
df.head(10)

                                                 val
0   你好 abcdefghijklmnopqrstuvwxyz1234567890abcdef...

In [40]:
cursor.execute('''
SELECT
    val,
    LEN(val) len,
    DATALENGTH(val) data_length
FROM
    sales.sql_server_nvarchar_length;
''')


# Fetch all rows from the executed query
rows = cursor.fetchall()

# Get the column names
columns = [column[0] for column in cursor.description]

# Convert the rows into a list of dictionaries
data = [dict(zip(columns, row)) for row in rows]

# Create a DataFrame from the list of dictionaries
df = pd.DataFrame(data)
df.head(10)

                                                 val  len  data_length
0   你好 abcdefghijklmnopqrstuvwxyz1234567890abcdef...  148          296

### DATE, TIME, DATETIME2, DATETIMEOFFSET

#### Date

It takes 3 bytes to store a DATE value. The default literal string format of a DATE value is as follows:

    YYYY-MM-DD

In this format:

    YYYY is four digits that represent a year, which ranges from 0001 to 9999.
    MM is two digits that represent a month of a year, which ranges from 01 to 12.
    DD is two digits that represent a day of the specified month, which ranges from 01 to 31, depending on the month.

In [42]:
cursor.execute('''
SELECT    
	order_id, 
	customer_id, 
	order_status, 
	order_date
FROM    
	sales.orders
WHERE order_date < '2016-01-05'
ORDER BY 
	order_date DESC;
''')

# Fetch all rows from the executed query
rows = cursor.fetchall()

# Get the column names
columns = [column[0] for column in cursor.description]

# Convert the rows into a list of dictionaries
data = [dict(zip(columns, row)) for row in rows]

# Create a DataFrame from the list of dictionaries
df = pd.DataFrame(data)
df.head(10)

   order_id  customer_id  order_status  order_date
0         6           94             4  2016-01-04
1         7          324             4  2016-01-04
2         8         1204             4  2016-01-04
3         4          175             4  2016-01-03
4         5         1324             4  2016-01-03
5         3          523             4  2016-01-02
6         1          259             4  2016-01-01
7         2         1212             4  2016-01-01

In [ ]:
Cursor.execute('''
CREATE TABLE sales.list_prices (
    product_id INT NOT NULL,
    valid_from DATE NOT NULL,
    valid_to DATE NOT NULL,
    amount DEC (10, 2) NOT NULL,
    PRIMARY KEY (
        product_id,
        valid_from,
        valid_to
    ),
    FOREIGN KEY (product_id) 
      REFERENCES production.products (product_id)
);

''')

cursor.execute('''
INSERT INTO sales.list_prices (
    product_id,
    valid_from,
    valid_to,
    amount
)
VALUES
    (
        1,
        '2019-01-01',
        '2019-12-31',
        400
    );
''')

In [43]:
cursor.execute('''
SELECT * FROM sales.list_prices
''')

# Fetch all rows from the executed query
rows = cursor.fetchall()

# Get the column names
columns = [column[0] for column in cursor.description]

# Convert the rows into a list of dictionaries
data = [dict(zip(columns, row)) for row in rows]

# Create a DataFrame from the list of dictionaries
df = pd.DataFrame(data)
df.head(10)

   product_id  valid_from    valid_to  amount
0          20  2024-10-02  2024-11-23  100.00
1          22  2010-10-02  2024-11-23  100.00

#### Time

The SQL Server TIME data type defines a time of a day based on 24-hour clock. The syntax of the TIME data type is as follows:

    TIME[ (fractional second scale) ]

The fractional second scale specifies the number of digits for the fractional part of the seconds. The fractional second scale ranges from 0 to 7. By default, the fractional second scale is 7 if you don’t explicitly specify it.

hh:mm:ss[.nnnnnnn]

In this format:

hh is two digits that represent the hour with a range from 0 to 23.
mm is two digits that represent the minute with a range from 0 to 59.
ss is two digits that represent the second with the range from 0 to 59.
The fractional seconds part can be zero to seven digits that has a range from 0 to 9999999.

In [45]:
cursor.execute('''
CREATE TABLE sales.visitation (
    visit_id INT PRIMARY KEY IDENTITY,
    customer_name VARCHAR (50) NOT NULL,
    phone VARCHAR (25),
    store_id INT NOT NULL,
    visit_on DATE NOT NULL,
    start_at TIME (0) NOT NULL,
    end_at TIME (0) NOT NULL,
    FOREIGN KEY (store_id) REFERENCES sales.stores (store_id)
);
''')

cursor.execute('''
INSERT INTO sales.visitation (
    customer_name,
    phone,
    store_id,
    visit_on,
    start_at,
    end_at
)
VALUES
    (
        'John Doe',
        '(408)-993-3853',
        1,
        '2018-06-23',
        '09:10:00',
        '09:30:00'
    );

''')

In [46]:
cursor.execute('''
SELECT * FROM sales.visitation
''')


# Fetch all rows from the executed query
rows = cursor.fetchall()

# Get the column names
columns = [column[0] for column in cursor.description]

# Convert the rows into a list of dictionaries
data = [dict(zip(columns, row)) for row in rows]

# Create a DataFrame from the list of dictionaries
df = pd.DataFrame(data)
df.head(10)

,visit_id,customer_name,phone,store_id,visit_on,start_at,end_at
0,1,John Doe,(408)-993-3853,1,2018-06-23,09:10:00,09:30:00

#### DATETIME2

DATETIME2(fractional seconds precision)

The DATETIME2 has two components: date and time.

    The date has a range from January 01, 01 (0001-01-01) to December 31, 9999 (9999-12-31)
    The time has a range from 00:00:00 to 23:59:59.9999999.
    The storage size of a DATETIME2 value depends on the fractional seconds precision. It requires 6 bytes for the precision that is less than 3, 7 bytes for the precision that is between 3 and 4, and 8 bytes for all other precisions.

The default string literal format of the DATETIME2 is as follows:

    YYYY-MM-DD hh:mm:ss[.fractional seconds]
                                                                                                                                                                                                            
Code language: SQL (Structured Query Language) (sql)
In this format:

    YYYY is a four-digit number that represents a year e.g., 2018. It ranges from 0001 through 9999.
    MM is a two-digit number that represents a month in a year e.g., 12. It ranges from 01 to 12.
    DD is a two-digit number that represents a day of a specified month e.g., 23. It ranges from 01 to 31.
    hh is a two-digit number that represents the hour. It ranges from 00 to 23.
    mm is a two-digit number that represents the minute. It ranges from 00 to 59.
    ss is a two-digit number that represents the second. It ranges from 00 to 59.
    The fractional seconds is zero to a seven-digit number that ranges from 0 to 9999999.

In [48]:
cursor.execute('''
CREATE TABLE sales.product_colors (
    color_id INT PRIMARY KEY IDENTITY,
    color_name VARCHAR (50) NOT NULL,
    created_at DATETIME2
);

''')

cursor.execute('''
INSERT INTO sales.product_colors (color_name, created_at)
VALUES
    ('Red', GETDATE()); 
''')


cursor.execute('''
INSERT INTO sales.product_colors (color_name, created_at)
VALUES
    ('Green', '2018-06-23 07:30:20');
''')

cursor.execute('''
SELECT * FROM  sales.product_colors
''')


# Fetch all rows from the executed query
rows = cursor.fetchall()

# Get the column names
columns = [column[0] for column in cursor.description]

# Convert the rows into a list of dictionaries
data = [dict(zip(columns, row)) for row in rows]

# Create a DataFrame from the list of dictionaries
df = pd.DataFrame(data)
df.head(10)

   color_id color_name                 created_at
0         1        Red 2024-11-25 18:48:52.343333
1         2      Green 2018-06-23 07:30:20.000000

#### DATETIMEOFFSET


For a datetime or time value, a time zone offset specifies the zone offset from UTC. A time zone offset is represented as [+|-] hh:mm:

    hh is two digits that range from 00 to 14, which represents the number of hour in the time zone offset.
    mm is two digits that range from 00 to 59, which represents the number of additional minutes in the time zone offset.
    +(plus) or -(minus) specifies whether the time zone offset is added or subtracted from the UTC time to return the local time.
    The valid range of a time zone offset is -14:00 to +14:00

In [49]:
cursor.execute('''
CREATE TABLE messages(
    id         INT PRIMARY KEY IDENTITY, 
    message    VARCHAR(255) NOT NULL, 
    created_at DATETIMEOFFSET NOT NULL
);
''')

In [52]:
cursor.execute('''
INSERT INTO  sales.visit_offset (visit_id, start_at)
VALUES (10, CAST ('2010-10-02 10:08:36.567878 -08:00' AS DATETIMEOFFSET) )
''')

In [53]:
cursor.execute('''
SELECT * FROM sales.visit_offset
''')

# Fetch all rows from the executed query
rows = cursor.fetchall()

# Get the column names
columns = [column[0] for column in cursor.description]

# Convert the rows into a list of dictionaries
data = [dict(zip(columns, row)) for row in rows]

# Create a DataFrame from the list of dictionaries
df = pd.DataFrame(data)
df.head(10)

ProgrammingError: ('ODBC SQL type -155 is not yet supported.  column-index=1  type=-155', 'HY106')